# Plant_GetToolPlcMode

## Description
Gets the current placement mode associated with the plant tool.

```pascal
FUNCTION Plant_GetToolPlcMode : INTEGER;
```

```python

def vs.Plant_GetToolPlcMode():
    return INTEGER
```

## Version
Availability: from Vectorworks 2014
## Category
* PlantObjectCoreTools